desc "课程标签分类"
task tag_category: :environment do
  # 创建标签分组
  [['考试等级', %w(高考 会考 中考 小升初考试 英语考级 奥数竞赛 高考志愿)],
   ['试卷讲解', %w(历年真题 期中期末试卷 自编试卷)],
   ['假期课程', %w(暑假课 寒假课 周末课 国庆假期课)],
   ['课程难度', %w(基础课 巩固课 提高课)],
   ['通用标签', %w(外教 冲刺 重点难点)]].each do |group_name, tags|
    group = TagGroup.find_or_create_by(name: group_name)
    Tag.where(name: tags).each do |tag|
      tag.tag_group_id = group.id
      tag.save
    end
  end

[["高三", ["高考", "高考志愿", "历年真题", "期中期末试卷", "自编试卷", "暑假课", "寒假课", "周末课", "国庆假期课", "基础课", "巩固课", "外教", "冲刺", "重点难点"]],
 ["高二", ["会考", "历年真题", "期中期末试卷", "自编试卷", "暑假课", "寒假课", "周末课", "国庆假期课", "基础课", "巩固课", "外教", "冲刺", "重点难点"]],
 ["高一", ["历年真题", "期中期末试卷", "自编试卷", "暑假课", "寒假课", "周末课", "国庆假期课", "基础课", "巩固课", "外教", "冲刺", "重点难点"]],
 ["初三", ["中考", "奥数竞赛", "历年真题", "期中期末试卷", "自编试卷", "暑假课", "寒假课", "周末课", "国庆假期课", "基础课", "巩固课", "外教", "冲刺", "重点难点"]],
 ["初二", ["奥数竞赛", "历年真题", "期中期末试卷", "自编试卷", "暑假课", "寒假课", "周末课", "国庆假期课", "基础课", "巩固课", "外教", "冲刺", "重点难点"]],
 ["初一", ["奥数竞赛", "历年真题", "期中期末试卷", "自编试卷", "暑假课", "寒假课", "周末课", "国庆假期课", "基础课", "巩固课", "外教", "冲刺", "重点难点"]],
 ["六年级", ["小升初考试", "奥数竞赛", "历年真题", "期中期末试卷", "自编试卷", "暑假课", "寒假课", "周末课", "国庆假期课", "基础课", "巩固课", "外教", "冲刺", "重点难点"]],
 ["五年级", ["奥数竞赛", "历年真题", "期中期末试卷", "自编试卷", "暑假课", "寒假课", "周末课", "国庆假期课", "基础课", "巩固课", "外教", "冲刺", "重点难点"]],
 ["四年级", ["奥数竞赛", "历年真题", "期中期末试卷", "自编试卷", "暑假课", "寒假课", "周末课", "国庆假期课", "基础课", "巩固课", "外教", "冲刺", "重点难点"]],
 ["三年级", ["历年真题", "期中期末试卷", "自编试卷", "暑假课", "寒假课", "周末课", "国庆假期课", "基础课", "巩固课", "外教", "冲刺", "重点难点"]],
 ["二年级", ["历年真题", "期中期末试卷", "自编试卷", "暑假课", "寒假课", "周末课", "国庆假期课", "基础课", "巩固课", "外教", "冲刺", "重点难点"]],
 ["一年级", ["历年真题", "期中期末试卷", "自编试卷", "暑假课", "寒假课", "周末课", "国庆假期课", "基础课", "巩固课", "外教", "冲刺", "重点难点"]],
 ["语文", ["高考", "会考", "中考", "小升初考试", "历年真题", "期中期末试卷", "自编试卷", "暑假课", "寒假课", "周末课", "国庆假期课", "基础课", "巩固课", "冲刺", "重点难点"]],
 ["数学", ["高考", "会考", "中考", "小升初考试", "奥数竞赛", "历年真题", "期中期末试卷", "自编试卷", "暑假课", "寒假课", "周末课", "国庆假期课", "基础课", "巩固课", "冲刺", "重点难点"]],
 ["英语", ["高考", "会考", "中考", "小升初考试", "历年真题", "期中期末试卷", "自编试卷", "暑假课", "寒假课", "周末课", "国庆假期课", "基础课", "巩固课", "外教", "冲刺", "重点难点"]],
 ["物理", ["高考", "会考", "中考", "历年真题", "期中期末试卷", "自编试卷", "暑假课", "寒假课", "周末课", "国庆假期课", "基础课", "巩固课", "冲刺", "重点难点"]],
 ["化学", ["高考", "会考", "中考", "历年真题", "期中期末试卷", "自编试卷", "暑假课", "寒假课", "周末课", "国庆假期课", "基础课", "巩固课", "冲刺", "重点难点"]],
 ["历史", ["高考", "会考", "中考", "历年真题", "期中期末试卷", "自编试卷", "暑假课", "寒假课", "周末课", "国庆假期课", "基础课", "巩固课", "冲刺", "重点难点"]],
 ["政治", ["历年真题", "期中期末试卷", "自编试卷", "暑假课", "寒假课", "周末课", "国庆假期课", "基础课", "巩固课", "冲刺", "重点难点", "高考", "会考", "中考"]],
 ["生物", ["高考", "会考", "历年真题", "期中期末试卷", "自编试卷", "暑假课", "寒假课", "周末课", "国庆假期课", "基础课", "巩固课", "冲刺", "重点难点"]],
 ["地理", ["高考", "会考", "历年真题", "期中期末试卷", "自编试卷", "暑假课", "寒假课", "周末课", "国庆假期课", "基础课", "巩固课", "冲刺", "重点难点"]],
 ["科学", ["小升初考试", "历年真题", "期中期末试卷", "自编试卷", "暑假课", "寒假课", "周末课", "国庆假期课", "基础课", "巩固课", "冲刺", "重点难点"]]].each do |cate_name, names|
    names ||= cate1
    names = cate2 if names.blank?
    names = cate3 if names == '3'
    tags = Tag.where(name: names)
    cate = TagCategory.find_or_create_by(name: cate_name)
    cate.tags = tags
    cate.save
  end

  cates = TagCategory.all.order('id').to_a
  [%w(高考 高考志愿 历年真题 期中期末试卷 自编试卷 暑假课 寒假课 周末课 国庆假期课 基础课 巩固课 外教 冲刺 重点难点),
   %w(会考 历年真题 期中期末试卷 自编试卷 暑假课 寒假课 周末课 国庆假期课 基础课 巩固课 外教 冲刺 重点难点),
   %w(历年真题 期中期末试卷 自编试卷 暑假课 寒假课 周末课 国庆假期课 基础课 巩固课 外教 冲刺 重点难点),
   %w(中考 历年真题 期中期末试卷 自编试卷 暑假课 寒假课 周末课 国庆假期课 基础课 巩固课 外教 冲刺 重点难点 奥数竞赛),
   %w(历年真题 期中期末试卷 自编试卷 暑假课 寒假课 周末课 国庆假期课 基础课 巩固课 外教 冲刺 重点难点 奥数竞赛),
   %w(历年真题 期中期末试卷 自编试卷 暑假课 寒假课 周末课 国庆假期课 基础课 巩固课 外教 冲刺 重点难点 奥数竞赛),
   %w(小升初考试 历年真题 期中期末试卷 自编试卷 暑假课 寒假课 周末课 国庆假期课 基础课 巩固课 外教 冲刺 重点难点 奥数竞赛),
   %w(历年真题 期中期末试卷 自编试卷 暑假课 寒假课 周末课 国庆假期课 基础课 巩固课 外教 冲刺 重点难点 奥数竞赛),
   %w(历年真题 期中期末试卷 自编试卷 暑假课 寒假课 周末课 国庆假期课 基础课 巩固课 外教 冲刺 重点难点 奥数竞赛),
   %w(历年真题 期中期末试卷 自编试卷 暑假课 寒假课 周末课 国庆假期课 基础课 巩固课 外教 冲刺 重点难点),
   %w(历年真题 期中期末试卷 自编试卷 暑假课 寒假课 周末课 国庆假期课 基础课 巩固课 外教 冲刺 重点难点),
   %w(历年真题 期中期末试卷 自编试卷 暑假课 寒假课 周末课 国庆假期课 基础课 巩固课 外教 冲刺 重点难点),
   %w(历年真题 期中期末试卷 自编试卷 暑假课 寒假课 周末课 国庆假期课 基础课 巩固课 冲刺 重点难点 高考 会考 中考 小升初考试),
   %w(历年真题 期中期末试卷 自编试卷 暑假课 寒假课 周末课 国庆假期课 基础课 巩固课 冲刺 重点难点 奥数竞赛 高考 会考 中考 小升初考试),
   %w(历年真题 期中期末试卷 自编试卷 暑假课 寒假课 周末课 国庆假期课 基础课 巩固课 外教 冲刺 重点难点 高考 会考 中考 小升初考试),
   %w(历年真题 期中期末试卷 自编试卷 暑假课 寒假课 周末课 国庆假期课 基础课 巩固课 冲刺 重点难点 高考 会考 中考),
   %w(历年真题 期中期末试卷 自编试卷 暑假课 寒假课 周末课 国庆假期课 基础课 巩固课 冲刺 重点难点 高考 会考 中考),
   %w(历年真题 期中期末试卷 自编试卷 暑假课 寒假课 周末课 国庆假期课 基础课 巩固课 冲刺 重点难点 高考 会考 中考),
   %w(历年真题 期中期末试卷 自编试卷 暑假课 寒假课 周末课 国庆假期课 基础课 巩固课 冲刺 重点难点 高考 会考 中考),
   %w(历年真题 期中期末试卷 自编试卷 暑假课 寒假课 周末课 国庆假期课 基础课 巩固课 冲刺 重点难点 高考 会考),
   %w(历年真题 期中期末试卷 自编试卷 暑假课 寒假课 周末课 国庆假期课 基础课 巩固课 冲刺 重点难点 高考 会考),
   %w(历年真题 期中期末试卷 自编试卷 暑假课 寒假课 周末课 国庆假期课 基础课 巩固课 冲刺 重点难点 小升初考试)].each_with_index do |arr, index|
    next if (arr - cates[index].tags.map(&:name)).empty? && (cates[index].tags.map(&:name) - arr).empty?
    raise "数据导入失败 #{cates[index].name}"
  end
end
